**Create DataFrame**

In [22]:
import numpy as np
import pandas as pd

In [23]:
dic = {
    "Name":['Aryan','Rajeev', 'Sameer', "Tinku"],
    "Marks":[89,92,12,86],
    "City":["Bettiah","Japan", "Mars","Jupyter"],
    "Hobby":["Study","Coding","Gambling","Games"]
}

In [24]:
df = pd.DataFrame(dic)

In [25]:
df

     Name  Marks     City     Hobby
0   Aryan     89  Bettiah     Study
1  Rajeev     92    Japan    Coding
2  Sameer     12     Mars  Gambling
3   Tinku     86  Jupyter     Games

In [26]:
df.head(2)

     Name  Marks     City   Hobby
0   Aryan     89  Bettiah   Study
1  Rajeev     92    Japan  Coding

In [27]:
df.tail(2)

     Name  Marks     City     Hobby
2  Sameer     12     Mars  Gambling
3   Tinku     86  Jupyter     Games

In [28]:
df.to_csv("Friends.csv")

In [29]:
df.to_csv("Friends2.csv", index=False)

In [30]:
df.describe()

           Marks
count   4.000000
mean   69.750000
std    38.577843
min    12.000000
25%    67.500000
50%    87.500000
75%    89.750000
max    92.000000

**Read Data**